In [7]:
import pandas as pd

In [16]:
staffs = {
    "fname": ["Omolewa", "Bukola", "Gabriel", "Brown", "Ogechi", "Loko"],
    "lname": ["Adaramola", "David", "Arobadi", "Ekeledo", "Adaramola", "Olowolagba"],
    "Salary": [100, 200, 100, 300, 100000, 600000000],
    "Country": ["Nigeria", "Canada", "Nigeria", "USA", "UK", "Cameroun"],
}

In [17]:
df = pd.DataFrame(staffs)

In [18]:
df

     fname       lname     Salary   Country
0  Omolewa   Adaramola        100   Nigeria
1   Bukola       David        200    Canada
2  Gabriel     Arobadi        100   Nigeria
3    Brown     Ekeledo        300       USA
4   Ogechi   Adaramola     100000        UK
5     Loko  Olowolagba  600000000  Cameroun

In [20]:
df.head(1)

     fname      lname  Salary  Country
0  Omolewa  Adaramola     100  Nigeria

In [23]:
df.tail(10)

     fname       lname     Salary   Country
0  Omolewa   Adaramola        100   Nigeria
1   Bukola       David        200    Canada
2  Gabriel     Arobadi        100   Nigeria
3    Brown     Ekeledo        300       USA
4   Ogechi   Adaramola     100000        UK
5     Loko  Olowolagba  600000000  Cameroun

In [24]:
df.dtypes

fname      object
lname      object
Salary      int64
Country    object
dtype: object

In [25]:
df.describe()

             Salary
count  6.000000e+00
mean   1.000168e+08
std    2.449408e+08
min    1.000000e+02
25%    1.250000e+02
50%    2.500000e+02
75%    7.507500e+04
max    6.000000e+08

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   fname    6 non-null      object
 1   lname    6 non-null      object
 2   Salary   6 non-null      int64
 3   Country  6 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

In [27]:
df

     fname       lname     Salary   Country
0  Omolewa   Adaramola        100   Nigeria
1   Bukola       David        200    Canada
2  Gabriel     Arobadi        100   Nigeria
3    Brown     Ekeledo        300       USA
4   Ogechi   Adaramola     100000        UK
5     Loko  Olowolagba  600000000  Cameroun

In [29]:
df.at[3, "Salary"]

300

In [64]:
staffs = {
    "fname": ["Omolewa", "Bukola", "Gabriel", "Brown", "Ogechi", "Loko"],
    "lname": ["Adaramola", "David", "Arobadi", "Ekeledo", "Adaramola", "Olowolagba"],
    "Salary": [100, 200, 100, "300", 100000, 600000000],
    "Country": ["Nigeria", "Canada", "Nigeria", "USA", "UK", "Cameroun"],
}

In [66]:
df = pd.DataFrame(staffs)

In [67]:
df

     fname       lname     Salary   Country
0  Omolewa   Adaramola        100   Nigeria
1   Bukola       David        200    Canada
2  Gabriel     Arobadi        100   Nigeria
3    Brown     Ekeledo        300       USA
4   Ogechi   Adaramola     100000        UK
5     Loko  Olowolagba  600000000  Cameroun

In [33]:
df.dtypes

fname      object
lname      object
Salary     object
Country    object
dtype: object

In [39]:
df.loc[(df['Country'] == "Nigeria") | (df['fname'] == "Bukola")]

     fname      lname Salary  Country
0  Omolewa  Adaramola    100  Nigeria
1   Bukola      David    200   Canada
2  Gabriel    Arobadi    100  Nigeria

In [40]:
sal = "300"

In [41]:
int(sal)

300

In [42]:
df

     fname       lname     Salary   Country
0  Omolewa   Adaramola        100   Nigeria
1   Bukola       David        200    Canada
2  Gabriel     Arobadi        100   Nigeria
3    Brown     Ekeledo        300       USA
4   Ogechi   Adaramola     100000        UK
5     Loko  Olowolagba  600000000  Cameroun

In [43]:
df['fname']

0    Omolewa
1     Bukola
2    Gabriel
3      Brown
4     Ogechi
5       Loko
Name: fname, dtype: object

In [44]:
df[['fname', 'lname']]

     fname       lname
0  Omolewa   Adaramola
1   Bukola       David
2  Gabriel     Arobadi
3    Brown     Ekeledo
4   Ogechi   Adaramola
5     Loko  Olowolagba

In [45]:
df.fname

0    Omolewa
1     Bukola
2    Gabriel
3      Brown
4     Ogechi
5       Loko
Name: fname, dtype: object

In [46]:
df

     fname       lname     Salary   Country
0  Omolewa   Adaramola        100   Nigeria
1   Bukola       David        200    Canada
2  Gabriel     Arobadi        100   Nigeria
3    Brown     Ekeledo        300       USA
4   Ogechi   Adaramola     100000        UK
5     Loko  Olowolagba  600000000  Cameroun

In [47]:
df.T

                 0       1        2        3          4           5
fname      Omolewa  Bukola  Gabriel    Brown     Ogechi        Loko
lname    Adaramola   David  Arobadi  Ekeledo  Adaramola  Olowolagba
Salary         100     200      100      300     100000   600000000
Country    Nigeria  Canada  Nigeria      USA         UK    Cameroun

In [48]:
df

     fname       lname     Salary   Country
0  Omolewa   Adaramola        100   Nigeria
1   Bukola       David        200    Canada
2  Gabriel     Arobadi        100   Nigeria
3    Brown     Ekeledo        300       USA
4   Ogechi   Adaramola     100000        UK
5     Loko  Olowolagba  600000000  Cameroun

In [60]:
df["Converted"] = df['Salary'].apply(lambda x: int(x))

In [54]:
df

     fname       lname     Salary   Country  Converted
0  Omolewa   Adaramola        100   Nigeria        100
1   Bukola       David        200    Canada        200
2  Gabriel     Arobadi        100   Nigeria        100
3    Brown     Ekeledo        300       USA        300
4   Ogechi   Adaramola     100000        UK     100000
5     Loko  Olowolagba  600000000  Cameroun  600000000

In [53]:
df.dtypes

fname        object
lname        object
Salary        int64
Country      object
Converted     int64
dtype: object

In [56]:
df.drop('Converted', axis = 1)

     fname       lname     Salary   Country
0  Omolewa   Adaramola        100   Nigeria
1   Bukola       David        200    Canada
2  Gabriel     Arobadi        100   Nigeria
3    Brown     Ekeledo        300       USA
4   Ogechi   Adaramola     100000        UK
5     Loko  Olowolagba  600000000  Cameroun

In [57]:
df

     fname       lname     Salary   Country  Converted
0  Omolewa   Adaramola        100   Nigeria        100
1   Bukola       David        200    Canada        200
2  Gabriel     Arobadi        100   Nigeria        100
3    Brown     Ekeledo        300       USA        300
4   Ogechi   Adaramola     100000        UK     100000
5     Loko  Olowolagba  600000000  Cameroun  600000000

In [58]:
df.drop('Converted', axis = 1, inplace=True) # persist

In [59]:
df

     fname       lname     Salary   Country
0  Omolewa   Adaramola        100   Nigeria
1   Bukola       David        200    Canada
2  Gabriel     Arobadi        100   Nigeria
3    Brown     Ekeledo        300       USA
4   Ogechi   Adaramola     100000        UK
5     Loko  Olowolagba  600000000  Cameroun

In [61]:
df

     fname       lname     Salary   Country  Converted
0  Omolewa   Adaramola        100   Nigeria        100
1   Bukola       David        200    Canada        200
2  Gabriel     Arobadi        100   Nigeria        100
3    Brown     Ekeledo        300       USA        300
4   Ogechi   Adaramola     100000        UK     100000
5     Loko  Olowolagba  600000000  Cameroun  600000000

In [62]:
df = df.drop('Converted', axis = 1, inplace=True) # persist

In [63]:
df

In [ ]:
lis = [1, 2, 3, 4]

In [ ]:
lis = 3

In [68]:
df

     fname       lname     Salary   Country
0  Omolewa   Adaramola        100   Nigeria
1   Bukola       David        200    Canada
2  Gabriel     Arobadi        100   Nigeria
3    Brown     Ekeledo        300       USA
4   Ogechi   Adaramola     100000        UK
5     Loko  Olowolagba  600000000  Cameroun

In [ ]:
df1 = df

In [ ]:
# copy and deepcopy